// pages/24/24.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    word1:"吉林大学（Jilin University），简称“吉大”，位于吉林省长春市，是中华人民共和国教育部直属全国重点大学，中央直管副部级建制，位列国家“双一流”、“211工程”、“985工程”，入选珠峰计划、2011计划、111计划、卓越法律人才教育培养计划、卓越工程师教育培养计划、卓越医生教育培养计划、卓越农林人才教育培养计划、国家建设高水平大学公派研究生项目、国家大学生创新性实验计划、新工科研究与实践项目、国家级大学生创新创业训练计划、国家创新人才培养示范基地、全国深化创新创业教育改革示范高校、中国政府奖学金来华留学生接收院校，首批建立研究生院的22所大学之一，21世纪学术联盟、亚太国际教育协会、中俄交通大学联盟、粤港澳大湾区物流与供应链创新联盟、医学“双一流”建设联盟成员。",
    word2:"学校始建于1946年，1952年经院系调整成为建国后中国共产党亲手创建的第一所综合性大学，1960年被列为全国重点大学。2000年，原吉林大学、吉林工业大学、白求恩医科大学、长春科技大学、长春邮电学院合并组建新吉林大学。2004年，原中国人民解放军军需大学转隶并入。",
    word3:"截至2022年2月，学校6个校区7个校园占地727万平方米，建筑面积272.9万平方米；下设52个学院，140个本科专业；有教师6506人，在籍学生76017人。有一级学科硕士点61个，一级学科博士点48个，博士后科研流动站44个；有一级学科国家重点学科4个（覆盖17个二级学科），二级学科国家重点学科15个，国家重点（培育）学科4个。"

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})