// pages/27/27.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    word1:"华南理工大学（South China University of Technology），简称“华工”，位于广东省广州市，由中华人民共和国教育部直属，是教育部与广东省人民政府共建的全国重点大学，位列国家“双一流”、“211工程”、“985工程”，入选高等学校学科创新引智计划、卓越工程师教育培养计划、卓越法律人才教育培养计划、新工科研究与实践项目、国家建设高水平大学公派研究生项目、中国政府奖学金来华留学生接收院校、教育部来华留学示范基地、首批高等学校科技成果转化和技术转移基地，为建筑老八校、卓越大学联盟、中俄工科大学联盟、中欧工程教育平台、粤港澳大湾区物流与供应链创新联盟、中英大学工程教育与研究联盟成员，全国首批博士和硕士学位授予单位，是首批“未来技术学院”建设高校；是以工见长，理工结合，管、经、文、法、医等多学科协调发展的综合性研究型大学。",
    word2:"华南理工大学原名华南工学院，最早可溯源至1918年成立的广东省立第一甲种工业学校，正式组建于1952年全国高等学校院系调整，是以中山大学工学院、华南联合大学理工学院、岭南大学理工学院工科系及专业、广东工业专科学校为基础，调入湖南大学、武昌中华大学、武汉交通学院、南昌大学、广西大学等五所院校部分工科系及专业组建而成，为新中国四大工学院之一；1960年成为全国重点大学；1988年更名为华南理工大学。",
    word3:"学校分三个校区，五山校区位于天河区石牌高校区；大学城校区位于番禺区广州大学城内；广州国际校区位于番禺区创新城。"

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})