// pages/25/25.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    word1:"西北工业大学（Northwestern Polytechnical University），简称“西工大”，是中华人民共和国工业和信息化部直属，中国唯一一所以同时发展航空、航天、航海工程教育和科学研究为特色的全国重点大学，位列国家“双一流”、“985工程”、“211工程”；入选“2011计划”、“111计划”、基础学科招生改革试点、卓越工程师教育培养计划、国家大学生创新性实验计划、新工科研究与实践项目、国家建设高水平大学公派研究生项目、中国政府奖学金来华留学生接收院校；卓越大学联盟、中俄工科大学联盟、中俄交通大学联盟、中英大学工程教育与研究联盟、“一带一路”航天创新联盟、全国高等军工院校课程思政联盟成员，学位授权自主审核单位，欧盟QB50项目亚洲区唯一发起单位与亚洲区总协调单位。",
    word2:"1938年国立北洋工学院、国立北平大学工学院、国立东北大学工学院、私立焦作工学院在陕西汉中组建国立西北工学院；1946年迁至咸阳，1950年更名为西北工学院；1952年交通大学、浙江大学、南京大学的航空工程系在南京组建华东航空学院；1956年迁至西安，更名为西安航空学院；1957年，西北工学院与西安航空学院合并组建西北工业大学；1970年，原中国人民解放军军事工程学院航空工程系整体并入。",
    word3:"截至2021年11月，学校友谊、长安及江苏太仓三个校区占地面积7100多亩，下设27个学院、74个本科专业；拥有21个博士后流动站、25个一级学科博士点、38个一级学科硕士点；教职工4300余人，全职院士7人，在校生3.6万余人。"

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})