// pages/13/13.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    word1:"北京师范大学（Beijing Normal University）是中华人民共和国教育部直属、教育部与北京市共建的全国重点大学，位列国家“双一流”、“985工程”、“211工程”，国家“七五”、“八五”首批重点建设十所大学之一；为中国高校行星科学联盟、京港大学联盟、粤港澳大湾区物流与供应链创新联盟成员；入选“珠峰计划”、“强基计划”、“2011计划”、“111计划”、“国培计划”、卓越法律人才教育培养计划、卓越教师培养计划、国家大学生创新性实验计划、国家级大学生创新创业训练计划、国家建设高水平大学公派研究生项目。", 
    word2:"学校的前身是1902年创立的京师大学堂师范馆，1908年改称京师优级师范学堂，独立设校，1912年改名为北京高等师范学校。1923年学校更名为北京师范大学，成为中国历史上第一所师范大学。1931年、1952年北平女子师范大学、辅仁大学先后并入北京师范大学。1959年，被中央确定为首批全国重点大学。2002年，成为首批拥有自主设置本科专业审批权的6所高校之一。2017年，学校进入国家“世界一流大学”建设A类名单。2018年，成为首批可开展学位授权自主审核单位的20所高校之一。",
    word3:"截至2021年5月，北京师范大学北京校区占地面积1191亩（海淀校园、西城校园、昌平校园），另建有北京师范大学珠海校区；全日制在校生24000余人；下设3个学部、27个学院、2个系、11个研究院（所）、4个书院；有博士后科研流动站28个，一级学科博士点35个，一级学科硕士点38个；开设本科专业77个。"

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})