// pages/29/29.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    word1:"华东师范大学（East China Normal University），简称“华东师大”，位于上海市，由中华人民共和国教育部直属，是教育部和上海市人民政府重点共建的综合性研究型全国重点大学；位列国家“双一流”、“985工程”、“211工程”，入选'强基计划'、“2011计划”、“111计划”、'国培计划'、基础学科拔尖学生培养计划2.0、国家大学生创新性实验计划、国家级大学生创新创业训练计划、国家建设高水平大学公派研究生项目、中国政府奖学金来华留学生接收院校、国家大学生文化素质教育基地，长三角高校合作联盟、金砖国家大学联盟、亚太高校书院联盟、中日人文交流大学联盟创始成员，国务院批准设立研究生院的高校，学位授权自主审核单位。",
    word2:"华东师范大学成立于1951年10月16日，是以大夏大学（1924年）和光华大学（1925年）为基础，同时调进圣约翰大学、复旦大学、同济大学和浙江大学等高校的部分系科，在大夏大学原址上创办的。1972年与上海师范学院、上海体育学院等院校合并，改名上海师范大学。1980年恢复华东师范大学校名。1997-1998年，上海幼儿师范高等专科学校、上海教育学院和上海第二教育学院等先后并入。",
    word3:"截至2022年5月，学校有闵行、中山北路两个校区，校园占地总面积约207公顷；设有4个学部，31个全日制学院，4个书院，2个实体研究院，3个管理型学院，1个教育部中学校长培训中心，85个本科专业；全日制本科生15538人；在校博士研究生3633人，硕士研究生16117人，在校留学生（学历生）1427人。"

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})