// pages/15/15.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    word1:"北京航空航天大学（Beihang University）简称“北航”，位于首都北京市，中央直管高校，是中华人民共和国工业和信息化部直属大学，位列国家“双一流”、“985工程”、“211工程”建设高校，入选珠峰计划、2011计划、111计划、卓越工程师教育培养计划、国家建设高水平大学公派研究生项目、中国政府奖学金来华留学生接收院校、国家级新工科研究与实践项目、国家级大学生创新创业训练计划、国家大学生创新性实验计划、全国深化创新创业教育改革示范高校、强基计划试点高校，为国际宇航联合会、中欧精英大学联盟、中国-西班牙大学联盟、中俄工科大学联盟、中国高校行星科学联盟、中国人工智能教育联席会、全国高等军工院校课程思政联盟、W3C组织成员。",
    word2:"北京航空航天大学创建于1952年，时名北京航空学院，由当时的清华大学、北洋大学、厦门大学、四川大学、重庆大学等八所院校的航空系合并组建，1959年学校被国家指定为全国重点高校，1988年4月改名为北京航空航天大学。2017年入选“世界一流大学和一流学科”建设高校A类名单。",
    word3:"截至2022年9月，学校分为学院路校区、沙河校区，总占地共3000多亩，总建筑面积170余万平方米；学校下有35个二级学院；有23个博士后科研流动站，30个博士学位授权一级学科点，40个硕士学位授权一级学科点，82个本科专业；有教职工4627人，其中专任教师2921人，两院院士31人，有全日制在校生37000余人，其中本科生与研究生比例为1:1，在校攻读学位的外国留学生1200余人"

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})