// pages/14/14.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    word1:"四川大学（Sichuan University），简称“川大”，位于四川省成都市，是中华人民共和国教育部直属、中央直管副部级的全国重点大学；位列国家“双一流”、“211工程”、“985工程”，入选“珠峰计划”、“2011计划”、“111计划”、“强基计划”、卓越工程师教育培养计划、卓越医生教育培养计划、卓越法律人才教育培养计划、国家建设高水平大学公派研究生项目、全国深化创新创业教育改革示范高校，为学位授权自主审核单位、中国研究生院院长联席会会员、医学“双一流”建设联盟成员、自主划线高校，是国家布局在中国西部重点建设的高水平研究型综合大学。",
    word2:"学校由原四川大学、原成都科学技术大学、原华西医科大学三所全国重点大学经过两次合并而成。原四川大学起始于1896年四川总督鹿传霖奉光绪特旨创办的四川中西学堂，是西南地区最早的近代高等学校；原成都科学技术大学是新中国院系调整时组建的第一批多科型工科院校；原华西医科大学源于1910年由西方基督教会组织在成都创办的华西协合大学，是西南地区最早的西式大学和中国最早培养研究生的大学之一。1994年原四川大学和原成都科学技术大学合并为四川联合大学，1998年恢复“四川大学”校名。2000年与原华西医科大学合并组建为新的四川大学。",
    word3:"截至2022年1月，学校有望江、华西和江安三个校区，占地面积7050亩，校舍建筑面积280.64万平方米，在建眉山校区；有教学科研岗共6571人，全日制普通本科生3.7万余人，硕博士研究生2.9万余人。"

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})