// pages/6/6.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    word1:"复旦大学，简称“复旦”，位于直辖市上海，是中华人民共和国教育部直属的全国重点大学，中央直管高校，由教育部与上海市重点共建，位列国家“双一流”、“985工程”、“211工程”建设高校，入选珠峰计划、强基计划、111计划、2011计划、卓越医生教育培养计划、卓越法律人才教育培养计划、国家建设高水平大学公派研究生项目、新工科研究与实践项目、中国政府奖学金来华留学生接收院校、深化创新创业教育改革示范高校、首批学位授权自主审核单位，是环太平洋大学联盟、九校联盟、全球大学高研院联盟、中国大学校长联谊会、东亚研究型大学协会、新工科教育国际联盟、医学“双一流”建设联盟、长三角研究型大学联盟、 长三角高校智库联盟、中俄综合性大学联盟成员，是一所综合性研究型大学。",
    word2:"学校前身是1905年创办的复旦公学，是中国最早由民间创办的高等学校之一。上海医科大学前身是1927年创办的国立第四中山大学医学院，是中国自主创办的国立高等医科院校。2000年，复旦大学与上海医科大学合并，组建新的复旦大学。2017年，学校入选“双一流”建设高校A类名单。",
    word3:"截至2020年4月，学校有邯郸校区、枫林校区、江湾校区、张江校区四个校区，占地面积约243.92万平方米，校舍建筑面积224.11万平方米；有直属院（系）35个，附属医院18家（其中4家筹建），设有本科专业79个；有普通本专科生13991人，研究生22232人，留学生2946人；在校教学科研人员3139人，中国科学院、中国工程院院士（含双聘）51人。"

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})