// pages/19/19.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    word1:"北京理工大学（Beijing Institute of Technology）隶属于中华人民共和国工业和信息化部，副部级建制，是国家“双一流”建设高校，国家“211工程”、“985工程”，入选高等学校学科创新引智计划、高等学校创新能力提升计划、卓越工程师教育培养计划、国家建设高水平大学公派研究生项目、国家大学生创新性实验计划、国家级大学生创新创业训练计划、新工科研究与实践项目、中国政府奖学金来华留学生接收院校、高等学校科技成果转化和技术转移基地，是工业和信息化部高校联盟、全国高等军工院校课程思政联盟、中国人工智能教育联席会、卓越联盟高校、延河高校人才培养联盟成员。",
    word2:"北京理工大学前身是1940年成立于延安的自然科学院，历经晋察冀边区工业专门学校、华北大学工学院等办学时期，1949年定址北京并接收中法大学校本部和数理化三个系，1952年定名为北京工业学院，1988年更名为北京理工大学。",
    word3:"截至2021年，学校占地188万平方米，建筑面积180万平方米，图书馆馆藏277.17万册，电子图书172.25万册，固定资产总额69.87亿元；教职工总数3373人，其中专任教师2268人；有全日制在校生30733人，其中本科生14848人，硕士生9955人，博士生4773人，学位留学生1157人；设有19个专业学院，9个书院；开办72个本科专业；拥有一级学科博士学位授权点28个，博士专业学位授权点4个，一级学科硕士学位授权点30个，硕士专业学位授权点15个，博士后科研流动站22个。设有27个基层党委、3个党总支、3个直属党支部。"

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})