// pages/22/22.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    word1:"天津大学（Tianjin University），简称 “天大” ，坐落于天津市，是中华人民共和国教育部直属的首批全国重点大学，是国家“双一流”建设高校、国家“211工程”和“985工程”建设高校，中国工程院和教育部10所工程教育改革试点高校之一，首批学位授权自主审核单位，入选国家“强基计划”、“2011计划”、“111计划” 、“卓越工程师教育培养计划”、国家大学生创新性实验计划、国家级大学生创新创业训练计划、国家建设高水平大学公派研究生项目、新工科研究与实践项目、首批高等学校科技成果转化和技术转移基地、国家大学生文化素质教育基地、全国首批深化创新创业教育改革示范高校，建筑老八校之一，中国-东盟工科大学联盟、中国与中欧国家科技创新大学联盟创始成员。",
    word2:"天津大学，其前身为北洋大学，始建于1895年10月2日，是中国第一所现代大学，开中国近代高等教育之先河；1912年1月，北洋大学堂定名为北洋大学校，1913年定名国立北洋大学；1951年，北洋大学与河北工学院合并后更名为天津大学。",
    word3:"截至2021年12月，卫津路校区占地总面积136.2万平方米，北洋园校区占地总面积243.6万平方米，滨海工业研究院校区占地总面积30.9万平方米；有全日制在校生38602人，其中本科生19091人，硕士研究生13840人，博士研究生5371人；有教职工4960人；下设27个学院（部）；有74个本科专业，43个一级学科硕士点，31个一级学科博士点，30个博士后科研流动站"

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})