// pages/17/17.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    word1:"东南大学（Southeast University），简称“东大”，本部位于南京，是中华人民共和国教育部直属全国重点大学，中央直管副部级建制，是国家“双一流”、“985工程”、“211工程”重点建设高校，入选“珠峰计划”、“强基计划”、“2011计划”、“111计划”、卓越工程师教育培养计划、卓越医生教育培养计划、学位授权自主审核单位、首批未来技术学院建设高校，为“建筑老八校”、卓越大学联盟、长三角可持续发展大学联盟、中英大学工程教育与研究联盟、中俄工科大学联盟、碳中和世界大学联盟成员。",
    word2:"东南大学肇始于1902年创建的三江师范学堂，后历经两江师范学堂、南京高等师范学校、国立东南大学、国立中央大学等重要历史时期。1952年全国高校院系调整，学校文理等科迁出，以原国立中央大学工学院为主体，先后并入复旦大学、交通大学、浙江大学、金陵大学等校的有关系科，在国立中央大学本部原址（今东南大学四牌楼校区）建立南京工学院。1988年复更名为东南大学。2000年与原南京铁道医学院、南京交通高等专科学校、南京地质学校合并组建新的东南大学。",
    word3:"截至2022年3月，东南大学建有四牌楼、九龙湖、丁家桥等校区，总占地面积5888亩；有35个院系，下设37个一级学科博士点、49个一级学科硕士点、87个本科专业；有12个学科入选第二轮“双一流”建设学科名单、5个学科在第四轮学科评估中获得A+；有全日制在校生36628人；有专任教师3211人，其中博士生导师1287人，硕士生导师2422人，两院院士16人。"

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})