// pages/26/26.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    word1:"厦门大学（Xiamen University），简称厦大（XMU），位于福建省厦门市，是由中华人民共和国教育部直属副部级综合性研究型全国重点大学，教育部、国家国防科技工业局、福建省和厦门市重点共建高校，位列国家“双一流”、“211工程“、“985工程”，首批学位授权自主审核单位，入选国家“2011计划”、“珠峰计划”、“强基计划”、“111计划”、卓越法律人才教育培养计划、卓越医生教育培养计划、卓越工程师教育培养计划、新工科研究与实践项目、国家大学生文化素质教育基地，是全国首批深化创新创业教育改革示范高校，全国大学生创新创业实践联盟、“21世纪海上丝绸之路”大学联盟牵头发起高校，中欧商校联盟、中国人工智能教育联席会创始会员，大学通识教育联盟、CDIO工程教育联盟、海西医学联盟、中国高校自贸区研究联盟成员。",
    word2:"厦门大学由爱国华侨领袖陈嘉庚先生于1921年创办，是中国近代教育史上第一所华侨创办的大学、国内最早招收研究生的大学之一、设立厦门大学马来西亚分校，成为中国首个在海外建设独立校园的大学、早期建筑入选全国重点文物保护单位和“首批中国20世纪建筑遗产”名录，被誉为“南方之强““中国最美大学”。",
    word3:"截至2022年4月，学校建有思明校区、漳州校区、翔安校区和马来西亚分校，4个校园占地9700多亩，其中马来西亚分校约900亩；有研究生院、6个学部、33个学院和16个研究院；有专任教师近3000人，两院院士32人；在校学生44000余人，本研比约为1:1。"

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})