// pages/3/3.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    word1:"浙江大学（Zhejiang University），简称“浙大”，位于浙江省杭州市，是中华人民共和国教育部直属的综合性全国重点大学，位列国家“双一流”、“211工程”、“985工程”，是九校联盟（C9）、中国大学校长联谊会、环太平洋大学联盟、世界大学联盟、全球大学校长论坛、全球高校人工智能学术联盟、国际应用科技开发协作网、新工科教育国际联盟、全球能源互联网大学联盟、CDIO工程教育联盟、医学“双一流”建设联盟成员，入选“珠峰计划”、“强基计划”、“2011计划”、“111计划”、卓越工程师教育培养计划、卓越医生教育培养计划、卓越法律人才教育培养计划、卓越农林人才教育培养计划、全国首批深化创新创业教育改革示范高校、学位授权自主审核单位。曾培养出厉绥之、束星北、李政道等杰出校友。",
    word2:"学校前身是创立于1897年的求是书院，1914年停办。1928年于求是书院旧址新建国立浙江大学。1937年举校西迁，在遵义、湄潭等地办学，1946年秋回迁杭州。1952年浙江大学部分系科转入中国科学院和其他高校，主体部分在杭州重组为若干所院校，后分别发展为原浙江大学、杭州大学、浙江农业大学和浙江医科大学。1998年，同根同源的四校实现合并，组建了新的浙江大学。",
    word3:"截至2020年8月，学校设有紫金港、玉泉、西溪、华家池、之江、舟山、海宁、宁波等8个校区；设有7个学部、37个专业学院（系）、1个工程师学院、2个中外合作办学学院、7家附属医院；占地面积6223440平方米。"

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})