// pages/30/30.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    word1:"中国农业大学（China Agricultural University），简称“中国农大”（CAU），坐落于北京市，是中华人民共和国教育部直属，中华人民共和国水利部、中华人民共和国农业农村部和北京市共建的一所全国重点大学，位列“双一流”、“985工程”、“211工程”建设高校，入选“基础学科招生改革试点”、“2011计划”、“111计划”、卓越工程师教育培养计划、卓越农林人才教育培养计划、国家建设高水平大学公派研究生项目、中国政府奖学金来华留学生接收院校、国家大学生文化素质教育基地，为中国―加州大学系统'10+10'合作科研联盟、学位授权自主审核单位成员高校。",
    word2:"中国农业大学肇始于1905年成立的京师大学堂农科大学。1949年9月，北京大学农学院、清华大学农学院和华北大学农学院合并成立北京农业大学。1952年10月，北京农业大学农业机械系与华北农业机械专科学校、中央农业部机耕学校合并成立北京机械化农业学院，同年11月，平原农学院并入北京机械化农业学院，1953年7月更名为北京农业机械化学院，1985年10月更名为北京农业工程大学。1995年9月，北京农业大学和北京农业工程大学合并组建中国农业大学。",
    word3:"截至2021年12月，学校占地面积125万平方米，校舍面积123万平方米；设有18个学院、1个实体教学单位和1个直属系，开办本科专业76个；有全日制本科生13483人，全日制研究生12134人；有专任教师2007人；有一级学科博士学位授权点23个、一级学科硕士学位授权点33个；馆藏图书近200万册。"

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})