// pages/28/28.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    word1:"大连理工大学（Dalian University of Technology）简称”大工“，坐落于辽宁省大连市，是中华人民共和国教育部直属的全国重点大学，教育部与国家国防科技工业局共建高校，教育部、辽宁省、大连市共建高校，国家“双一流”建设高校，国家“985工程”、“211工程”建设高校，卓越大学联盟、中俄工科大学联盟、中俄交通大学联盟、中欧工程教育平台、全国16所工科重点大学科技工作研讨会、中国人工智能教育联席会主要成员，入选国家“2011计划”、“111计划”、卓越工程师教育培养计划、国家建设高水平大学公派研究生项目、新工科研究与实践项目、中国政府奖学金来华留学生接收院校、国家实施工程教育改革试点高校、国家大学生创新性实验计划、国家级大学生创新创业训练计划、全国首批深化创新创业教育改革示范高校、首批全国高校实践育人创新创业基地、首批高等学校科技成果转化和技术转移基地。",
    word2:"学校前身是创建于1949年4月的大连大学工学院；1950年7月大连大学建制撤销，大连大学工学院独立为大连工学院；1988年3月更名为大连理工大学。",
    word3:"截至2022年3月，学校设有大连凌水、开发区、盘锦等三个校区，总占地面积357.13万平方米，建筑面积约188.25万平方米；主校区设有20个学部学院，开发区校区设有3个学院，盘锦校区设有3个学院，另有3个专门学院和1所独立学院，开设93个本科专业；有教职工4473人，学生总数46450人，其中本科生总人数25603人，研究生总人数20847人"

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})