// pages/21/21.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    word1:"山东大学（Shandong University），位于山东省济南市，是中华人民共和国教育部直属全国重点大学，中央直管副部级建制，位列国家“双一流”、“985工程”、“211工程”，入选“2011计划”、“珠峰计划”、“强基计划”、“111计划”、卓越工程师教育培养计划、卓越医生教育培养计划、卓越法律人才教育培养计划、国家建设高水平大学公派研究生项目、新工科研究与实践项目、中国政府奖学金来华留学生接收院校、教育部来华留学示范基地、学位授权自主审核单位、医学“双一流”建设联盟，为全球能源互联网大学联盟成员。",
    word2:"山东大学是中国近代高等教育起源性大学。主体是1901年创办的山东大学堂，是继京师大学堂之后中国创办的第二所官立大学；其医学学科起源于1864年，开启近代中国高等医学教育之先河。从诞生之日起，学校先后历经了山东大学堂、国立青岛大学、国立山东大学、山东大学以及由原山东大学、山东医科大学、山东工业大学三校合并组建的新山东大学等几个历史发展时期。",
    word3:"截至2018年8月，学校总占地8000余亩， 形成了一校三地（济南、威海、青岛）八个校园的办学格局；设有55个教学院系，4所附属医院，3所非隶属附属医院，11所教学、实习医院；一级学科博士点44个，一级学科硕士点55个，专业学位博士点3个，专业学位硕士点27个，本科专业93个，博士后科研流动站42个；在职教职工7493人，专任教师4530人（不含附属医院）；有全日制本科生42286人，研究生26818人，留学生1560人。"

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})