// pages/16/16.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    word1:"同济大学（Tongji University；Tongji-Universität），简称“同济”，位于上海市，是中华人民共和国教育部直属的全国重点大学；国家“双一流”建设高校，国家“985工程”和“211工程”建设高校；入选“珠峰计划”、“强基计划”、“2011计划”、“111计划”、卓越工程师教育培养计划、卓越法律人才教育培养计划、卓越医生教育培养计划、国家大学生创新性实验计划、国家建设高水平大学公派研究生项目、中国政府奖学金来华留学生接收院校、国家级大学生创新创业训练计划、国家创新人才培养示范基地、新工科研究与实践项目、全国深化创新创业教育改革示范高校；首批学位授权自主审核单位，21世纪学术联盟、国际设计艺术院校联盟、国际铁路联盟、中俄工科大学联盟、中欧工程教育平台、卓越大学联盟、环太平洋大学联盟、联合国环境规划署全球环境与可持续发展大学合作联盟主席单位，国际绿色校园联盟，中美“10+10”计划、同济-伯克利工程联盟成员，国家世界一流大学建设A类高校。",
    word2:"同济大学前身是1907年德国医生埃里希·宝隆在上海创办的德文医学堂；1908年改名同济德文医学堂；1912年与同济德文工学堂合称同济德文医工学堂；1923年正式定名同济大学；1927年成为国立同济大学，是中国最早的七所国立大学之一。",
    word3:"截至2022年，学校设有29个专业学院，11家附属医院；共有四平路、嘉定、沪西和沪北4个校区，占地面积约2.56平方公里，总建筑面积184余万㎡；有专任教师2792人，正高级1096人，中外院士67人。"

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})