// pages/23/23.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    word1:"中南大学（Central South University），位于湖南省长沙市，是中华人民共和国教育部直属的全国重点大学，中央直管副部级建制，位列国家“双一流”、“985工程”、“211工程”，入选国家“2011计划”牵头高校、“111计划”、“强基计划”、卓越工程师教育培养计划、卓越医生教育培养计划、卓越法律人才教育培养计划、国家创新人才培养示范基地、国家级大学生创新创业训练计划、国家建设高水平大学公派研究生项目、新工科研究与实践项目、中国政府奖学金来华留学生接收院校、学位授权自主审核单位、自主划线高校、医学“双一流”建设联盟、国家知识产权示范高校、基础学科拔尖学生培养计划2.0基地、中国-中亚国家大学联盟、中俄交通大学联盟，高水平公共卫生学院建设高校，是全国首批试点开展八年制医学教育（本博连读）的五所大学之一。",
    word2:"中南大学由原湖南医科大学、长沙铁道学院与中南工业大学于2000年4月合并组建而成。原中南工业大学的前身为创建于1952年的中南矿冶学院，原长沙铁道学院的前身为创建于1953年的中南土木建筑学院，两校的主体学科最早溯源于1903年创办的湖南高等实业学堂。原湖南医科大学的前身为1914年创建的湘雅医学专门学校，是我国创办最早的西医高等学校之一。",
    word3:"截至2022年9月，学校占地面积317万平方米，建筑面积217万平方米；设有30个二级学院，开设103个本科专业；有全日制在校学生6.0万余名，其中本科生3.5万余人、研究生2.5万余人、国际学生2200余人。"

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})