// pages/20/20.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    word1:"南开大学（Nankai University），简称“南开”，位于天津市，是中华人民共和国教育部直属的全国重点大学，是国家“双一流”建设高校，国家“211工程”和“985工程”建设高校，入选国家“珠峰计划”、“强基计划”、“2011计划”、“111计划”、卓越法律人才教育培养计划、国家建设高水平大学公派研究生项目、全国深化创新创业教育改革示范高校、中国政府奖学金来华留学生接收院校、学位授权自主审核单位，为国际公立大学论坛成员。",
    word2:"南开大学由严修、张伯苓秉承教育救国理念创办，成立于1919年。1937年校园遭侵华日军炸毁而南迁，私立南开大学与北京大学、清华大学在长沙合并组建国立长沙临时大学，1938年迁往昆明，更名为国立西南联合大学；1946年回津复校并改为国立；新中国成立后，经历高等学校院系调整，成为文理并重的全国重点大学；改革开放以来，天津对外贸易学院、中国旅游管理干部学院相继并入。",
    word3:"截至2021年12月，学校占地443.12万平方米，其中八里台校区占地121.60万平方米，津南校区占地245.89万平方米，泰达学院占地6.72万平方米，校舍建筑总面积195.19万平方米；有专业学院26个、本科专业93个；有一级学科硕士点11个，专业学位硕士点27个，一级学科博士点31个，二级学科博士点1个，博士后科研流动站28个；有专任教师2202人，在校学生32599人，其中本科生16902人，硕士研究生10966人、博士研究生4731人。"

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})