// pages/10/10.js
Page({
  /**
   * 页面的初始数据
   */
  data: {
    word1:"西安交通大学（Xi’an Jiaotong University），简称“西安交大”，位于陕西省西安市，是中华人民共和国教育部直属的综合性研究型全国重点大学，由教育部与国家国防科技工业局共建，位列国家“双一流”，首批进入国家“211工程”和“985工程”，是国家“七五”“八五”重点建设高校，入选“珠峰计划”“强基计划”“2011计划”“111计划”、卓越工程师教育培养计划、卓越医生教育培养计划、卓越法律人才教育培养计划，是环太平洋大学联盟、九校联盟（C9）、中国大学校长联谊会、全球能源互联网大学联盟、中俄综合性大学联盟、中俄交通大学联盟、CDIO工程教育联盟、丝绸之路大学联盟成员高校，是中国人工智能教育联席会理事长单位、学位授权自主审核单位，是中国三所开设少年班高校之一。",
    word2:"1896年在上海创建了南洋公学；1921年定名为交通大学；1956年交通大学的主体内迁西安；1957年分设为交通大学西安、上海两个部分，实行统一领导；1959年，交通大学西安部分定名为西安交通大学；2000年国务院决定将西安交通大学、西安医科大学、陕西财经学院三校合并，组成新的西安交通大学。",
    word3:"截至2021年11月，学校兴庆、雁塔、曲江、中国西部科技创新港四个校区占地约4658亩，下设27个学院（部、中心）、9个本科书院，开设90个本科专业；拥有博士后流动站30个，一级学科博士点32个，专业学位博士点6个，一级学科硕士点41个，专业学位硕士点27个；国家一级重点学科8个；有教职工6538人，在校生48082人。"

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})