// pages/5/5.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    word1:"南京大学（Nanjing University），简称“南大”，位于江苏省南京市，是中华人民共和国教育部直属、中央直管副部级建制的全国重点大学，位列国家“双一流”、“985工程”、“211工程” 重点建设高校，入选“珠峰计划”、“强基计划”、“111计划”、“2011计划”，为九校联盟（C9）、中国大学校长联谊会、环太平洋大学联盟、21世纪学术联盟、全球大学高研院联盟、国际应用科技开发协作网、东亚研究型大学协会、新工科教育国际联盟、中国高校行星科学联盟、长三角研究型大学联盟、学位授权自主审核单位成员，首批国家级双创示范基地。",
    word2:"南京大学肇始于1902年创建的三江师范学堂，此后历经两江师范学堂、南京高等师范学校、国立东南大学、国立中央大学等历史时期，1950年更名为南京大学。1952年，调整出部分院系后与创办于1888年的金陵大学文、理学院等合并，仍名南京大学。校址从四牌楼迁至鼓楼金陵大学原址。2006年，教育部和江苏省签订重点共建南京大学的协议。2011年，教育部和江苏省签署协议继续重点共建南京大学。",
    word3:"截至2022年5月，学校有四个校区，33个院系，本科生13350人、硕士研究生17201人、博士研究生8385人、留学生1117人。现有一级学科国家重点学科8个，二级学科国家重点学科13个，“双一流”建设学科16个，本科专业89个，博士学位授权一级学科点42个，博士学位授权二级学科点1个，专业博士学位授权点5个，硕士学位授权一级学科点4个，专业硕士学位授权点28个，博士后流动站38个。"

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})