// pages/4/4.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    word1:"上海交通大学（Shanghai Jiao Tong University），简称“上交”，位于上海，是教育部直属、上海市共建、中央直管的全国重点大学，位列国家“双一流”、“985工程”、“211工程”，为九校联盟、环太平洋大学联盟、21世纪学术联盟、中国大学校长联谊会、Universitas 21、国际应用科技开发协作网、新工科教育国际联盟成员，入选“珠峰计划”、“强基计划”、“111计划”、“2011计划”、卓越医生教育培养计划、卓越法律人才教育培养计划、卓越工程师教育培养计划、卓越农林人才教育培养计划、国家建设高水平大学公派研究生项目、中国政府奖学金来华留学生接收院校、学位授权自主审核单位。",
    word2:"学校创建于1896年，原名南洋公学，1911年更名为南洋大学堂，1929年更名为国立交通大学，1949年更名为交通大学；1957年经历西迁与分设，分为交通大学上海部分和西安部分；1959年，交通大学上海部分启用“上海交通大学”校名；1999年，原上海农学院并入；2005年，与原上海第二医科大学合并。",
    word3:"学校共有33个学院/直属系，31个研究院，12家附属医院，2个附属医学研究所，23个直属单位，5个直属企业。全日制本科生（国内）17071人、全日制硕士研究生14589人、全日制博士研究生9903人，学位留学生2513人，其中研究生学位留学生1488人；有专任教师3307名；至2020年9月，有博士后流动站38个，一级学科博士点47个，专业学位博士点7个，一级学科硕士点56个，专业学位硕士点31个，本科专业71个。"

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})