// pages/18/18.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    word1:"中国人民大学（Renmin University of China），简称“人大”，位于北京，是教育部直属高校，教育部与北京市共建，位列国家“双一流”、“211工程”、“985工程”，为世界大学联盟、国际应用科技开发协作网、亚太国际教育协会、京港大学联盟成员，入选国家“强基计划”、“111计划”、“2011计划”、卓越法律人才教育培养计划、卓越农林人才教育培养计划、国家建设高水平大学公派研究生项目、新工科研究与实践项目、中国政府奖学金来华留学生接收院校，是一所以人文社会科学为主的综合性研究型全国重点大学。",
    word2:"学校前身是1937年成立的陕北公学，以及后来华北联合大学和北方大学、华北大学。1949年12月16日，中央人民政府政务院通过了《关于成立中国人民大学的决定》。1950年10月3日，以华北大学为基础合并组建的中国人民大学正式开学，成为新中国创办的第一所新型正规大学。1954年，被确定为以社会科学为主的综合大学和首批全国重点大学；1960年，被确定为综合性全国重点大学；2017年入选国家“双一流”建设名单。",
    word3:"截至2021年11月，学校设有39个学院（书院），另设有体育部、继续教育学院、深圳研究院等；开设本科专业83个；有博士后流动站21个，一级学科博士学位授权点22个，一级学科硕士学位授权点37个；拥有8个国家重点一级学科，8个国家重点二级学科；图书馆收藏纸质图书436.7余万册；专任教师1951人；全日制在校生28501人，其中本科生11354人，硕士生11149人，博士生4792人，留学生1206人。"

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})