// pages/8/8.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    word1:"华中科技大学（Huazhong University of Science and Technology），简称华中大、华科大，位于湖北省武汉市，是中华人民共和国教育部直属的综合性研究型全国重点大学、位列国家'双一流'、'985工程'、'211工程'、入选'强基计划'、'111计划'、卓越工程师教育培养计划、卓越医生教育培养计划、国家大学生创新性实验计划、国家级大学生创新创业训练计划、国家建设高水平大学公派研究生项目、国家级新工科研究与实践项目、基础学科拔尖学生培养计划2.0，是学位授权自主审核单位、全国深化创新创业教育改革示范高校、一流网络安全学院建设示范项目高校、中国政府奖学金来华留学生接收院校、教育部来华留学示范基地，为中欧工程教育平台成员和医学“双一流”建设联盟、国际应用科技开发协作网、全球能源互联网大学联盟成员。",
    word2:"学校前身是1952年创办的华中工学院、1907年建立的上海德文医学堂和1898年建立的湖北工艺学堂。历经传承与发展，2000年由原华中理工大学、同济医科大学、武汉城市建设学院合并成立华中科技大学。",
    word3:"截至2022年2月，学校占地7000余亩，绿化覆盖率72%；有专任教师3700余人，其中教授1400余人，副教授1400余人；教师中有院士20人，“973计划”项目首席科学家15人；设有109个本科专业，48个硕士学位授权一级学科，46个博士学位授权一级学科，39个博士后科研流动站；有“双一流”建设学科9个，一级学科国家重点学科7个，二级学科国家重点学科15个，国家重点（培育）学科7个。"

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})