// pages/11/11.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    word1:"哈尔滨工业大学（Harbin Institute of Technology），简称哈工大，位于黑龙江省哈尔滨市南岗区，是由工业和信息化部直属的全国重点大学，位列国家“双一流”、“985工程”、“211工程”，九校联盟、环太平洋大学联盟、中国大学校长联谊会、卓越大学联盟、全球能源互联网大学联盟、中俄工科大学联盟、中国-西班牙大学联盟、中国人工智能教育联席会、全国高等军工院校课程思政联盟创始成员，入选珠峰计划、强基计划、2011计划、111计划、卓越工程师教育培养计划、国家大学生创新性实验计划、国家建设高水平大学公派研究生项目、新工科研究与实践项目、中国政府奖学金来华留学生接收院校、全国深化创新创业教育改革示范高校等，是首批设有研究生院、拥有研究生自主划线资格的高校，首批学位授权自主审核单位。",
    word2:"学校始建于1920年，创办名称是哈尔滨中俄工业学校，后历经中俄工业大学校、东省特区工业大学校时期，1928年，学校正式定名为哈尔滨工业大学。1951年被确定为全国学习国外高等教育办学模式的两所样板大学之一，1954年进入国家首批重点建设的6所高校行列。1996年进入国家”211工程“首批重点建设高校。1999年被确定为国家首批”985工程“重点建设的9所大学之一。2000年与哈尔滨建筑大学合并组建新的哈尔滨工业大学。",
    word3:"截至2022年5月，学校有哈尔滨、威海、深圳三个校区；校园面积565.42万平方米，建筑面积355.08万平方米；下设22个学院，本科专业107个；专任教师4110人，在校学生55901人。"

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})